# Taps
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'go'
brew 'grep'
brew 'imagemagick'
brew 'jq' 
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'ripgrep'
brew 'ruby'
brew 'stripe/stripe-cli/stripe'
brew 'tree-sitter'
brew 'yarn'
brew 'zsh'

# Utils
cask 'karabiner-elements'
cask 'maccy'
cask 'ngrok'
cask 'raycast'

# Apps
cask 'bitwarden'
cask 'claude'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'kitty'
cask 'messenger'
cask 'obs'
cask 'qbittorrent'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

# Fonts
cask 'font-iosevka'
cask 'font-terminus'

# Mac App Store example
# mas 'Byword', id: 420212497
